<a href="https://colab.research.google.com/github/Nishanth-developer/20BCE0118-NISHANTH-PRAC-BOOKS/blob/main/missingdata_nishanth_20BCE0118.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
d=pd.read_csv("property data.csv")
print(d)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

`Pandas automatically detects Nan and empty value as missing value.`

In [ ]:
print(d['PID'].isnull())

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: PID, dtype: bool

`To include other kind of null values as missing data:`

`In below code, actually the last element shd be true.`

In [ ]:
print(d['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

`Hence`

In [ ]:
miss_list=['--','na']
d=pd.read_csv('property data.csv',na_values=miss_list)
print(d)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

`Now time for unexpected missing values. ie) data type collisions`

`OWN_OCCUPIED has 12(int value) though it is of type bool ( Y/N string)`

In [ ]:
print(d['OWN_OCCUPIED'])

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [ ]:
print(d['OWN_OCCUPIED'].isnull())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

`Here third entry should be true`

In [ ]:
ci=0
for i in d['OWN_OCCUPIED']:
    try:
        a=int(i)
        d['OWN_OCCUPIED'][ci]=np.nan
    except ValueError:
        pass
    ci+=1
print(d['OWN_OCCUPIED'])

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [ ]:
print(d['OWN_OCCUPIED'])

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

`Hence that third integer is finally rectified`

In [ ]:
print(d)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

`Now we are done with giving null values at apt places`
`Now Summarizing the entire missing elements (count)`

In [ ]:
print(d.isnull().values.any())

True

In [ ]:
print(d.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

`Total count of missing values`

In [ ]:
print(d.isnull().sum().sum())

11

`Filling missing values (imputation)`

`Using Mean - Common imputations using mean,median,mode`

In [ ]:
import pandas as pd
import numpy as np
miss_list=['--','na']
d=pd.read_csv('property data.csv',na_values=miss_list)
ci=0
for i in d['OWN_OCCUPIED']:
    try:
        a=int(i)
        d['OWN_OCCUPIED'][ci]=np.nan
    except ValueError:
        pass
    ci+=1
d

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
mean=d['PID'].mean()
e=d.copy()
e['PID'].fillna(mean,inplace=True)
print(e)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0
           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
me=e['ST_NUM'].median()
e['ST_NUM'].fillna(me,inplace=True)
e

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   203.0   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0   203.0  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
mo=e['OWN_OCCUPIED'].mode()
e['OWN_OCCUPIED'].fillna(mo,inplace=True)
e
y,n=0,0
for i in e['OWN_OCCUPIED']:
  if i=='Y':
    y+=1
  elif i=='N':
    n+=1
if y>=n:
  e['OWN_OCCUPIED']=e['OWN_OCCUPIED'].replace(np.nan,'Y')
e

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   203.0   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0   203.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
mo=e['NUM_BEDROOMS'].mode()
e['NUM_BEDROOMS']=e['NUM_BEDROOMS'].replace(np.nan,int(mo))
e

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   203.0   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0      NaN   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0   203.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           3.0        2  1800.0

In [ ]:
mo1=e['NUM_BATH'].mode()
for i in e['NUM_BATH']:
  try:
    a=int(i)
    pass
  except ValueError:
    e['NUM_BATH']=e['NUM_BATH'].replace(i,np.nan)
e['NUM_BATH'].fillna(int(mo1),inplace=True)
e['SQ_FT'].fillna(e['SQ_FT'].mean(),inplace=True)
e

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0        1  1100.0
2  100003000.0   203.0   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0        1   700.0
4  100005000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0   203.0  WASHINGTON            Y           2.0        1   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1100.0
8  100009000.0   215.0     TREMONT            Y           3.0        2  1800.0

`But the above derived dataset is not perfect. Hence we should go for some advanced imputations`

`Before that : skitleanr`

`Let me recreate the original table ( contains missing values )`

`Filling (imputing) the null values with mean, median, mode using sklearn`

`Original table`

In [6]:
import pandas as pd
import numpy as np
import sklearn
from sklearn.impute import SimpleImputer
dor=pd.read_csv('property data.csv')
print(dor)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

`Normalised all diff transforms of Nan to np.nan`

In [22]:
miss=['--','na']
dor=pd.read_csv('property data.csv',na_values=miss)
dor

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [27]:
miss=['--','na']
d=pd.read_csv('property data.csv',usecols=['PID','ST_NUM','NUM_BEDROOMS','SQ_FT'],na_values=miss)
d.head()

           PID  ST_NUM  NUM_BEDROOMS   SQ_FT
0  100001000.0   104.0           3.0  1000.0
1  100002000.0   197.0           3.0     NaN
2  100003000.0     NaN           NaN   850.0
3  100004000.0   201.0           1.0   700.0
4          NaN   203.0           3.0  1600.0

In [28]:
imp=SimpleImputer(strategy='mean')
imp.fit(d)

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='mean', verbose=0)

`4 mean values are added to 4 columns specified`

In [29]:
imp.statistics_

array([1.00005000e+08, 1.91428571e+02, 2.16666667e+00, 1.10000000e+03])

In [35]:
d=imp.transform(d)
d

array([[1.00001000e+08, 1.04000000e+02, 3.00000000e+00, 1.00000000e+03],
       [1.00002000e+08, 1.97000000e+02, 3.00000000e+00, 1.10000000e+03],
       [1.00003000e+08, 1.91428571e+02, 2.16666667e+00, 8.50000000e+02],
       [1.00004000e+08, 2.01000000e+02, 1.00000000e+00, 7.00000000e+02],
       [1.00005000e+08, 2.03000000e+02, 3.00000000e+00, 1.60000000e+03],
       [1.00006000e+08, 2.07000000e+02, 2.16666667e+00, 8.00000000e+02],
       [1.00007000e+08, 1.91428571e+02, 2.00000000e+00, 9.50000000e+02],
       [1.00008000e+08, 2.13000000e+02, 1.00000000e+00, 1.10000000e+03],
       [1.00009000e+08, 2.15000000e+02, 2.16666667e+00, 1.80000000e+03]])

In [36]:
dfin=pd.DataFrame(d,columns=['PID','ST_NUM','NUM_BEDROOMS','SQ_FT'])
dfin

           PID      ST_NUM  NUM_BEDROOMS   SQ_FT
0  100001000.0  104.000000      3.000000  1000.0
1  100002000.0  197.000000      3.000000  1100.0
2  100003000.0  191.428571      2.166667   850.0
3  100004000.0  201.000000      1.000000   700.0
4  100005000.0  203.000000      3.000000  1600.0
5  100006000.0  207.000000      2.166667   800.0
6  100007000.0  191.428571      2.000000   950.0
7  100008000.0  213.000000      1.000000  1100.0
8  100009000.0  215.000000      2.166667  1800.0



---

---

**`Practice -- `**

> **`Numpy, Pandas, Matplotlib`**





---

---